dict_ticket={
    'G1569':['北京南-天津南','18:06','18:39','00:33'],
    'G1567':['北京南-天津南','18:15','18:49','00:34'],
    'G8917':['北京南-天津西','18:20','18.19','00:59'],
    'G203':['北京南-天津南','18:35','19:09','00:34']
}
print('车次    出发站-到达站     出发时间   到达时间   历时时长')
for key,value in  dict_ticket.items():
    print(key,value)
buy=input('请输入要购买的车次：')
info=dict_ticket.get(buy,'车次不存在')
if info!='车次不存在':
    person=input('请输入乘车人，如果是多位乘车人请用逗号分割：')
    s=info[0]+''+info[1]+'开'
    print('你购买了'+buy+''+s+',请'+person+'尽快领取纸质车票。[铁路客服]')
else:
    print('对不起，选择的车次可能不存在')
